SSLD/4-1 4.5 Power, Balance and Giving.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 4-1 4.5 Power, Balance and Giving
#+begin_verse
Okay, so relationships are complex
	and the whole idea of one person intrinsically having more power than the other.
You're ultimately saying that's not a given.
So with this in mind,
	is there a way for a relationship to be totally equitable and reciprocal in terms of power?
I have to be very careful here,
	like if I say that we don't have to be like always fair
		and relationships do not have to be equitable,
	I can probably get myself into deep trouble, right?
[LAUGH] So I have to be very careful here.
Well obviously, we do not want to see any relationship turning into something that is oppressive.
That is exploitative.
That is grossly unfair for one or both of the participants.
But having said that, we have to understand
	that like the whole concept of fairness and equity probably
		needs some kind of like careful, critical re-thinking.
		
You know, in the relationship, like very often, ideal relationships would have this element of love.
And this element of love, according to my own understanding,
	can very often entail one party making certain sacrifices, so to speak.
Imagine like a mother waking up like 3 AM in the morning to a crying baby, all right?
Then, the mother will, obviously, be forgoing some of her own needs, like the need for rest,
	like may have something important to deal with in the morning or whatever.
But then in an ideal situation, the mother will actually feel good after pacifying a baby.
And then, the baby is not crying again and she then goes back to sleep.
So in this particular act, the mother gives and the baby receives.
But then maybe the mother derives a bigger sense of satisfaction than the baby,
	we don't know, all right?
I cannot be sure.
But that's just how it may work.
And then when we look at any like ideal loving relationship.
That's what we hope will happen.

And people are not calculating like I've given this much and you have not.
Like put in your fair share.
And I've done so much for you and you don't really care for me.
We hear that a lot when couples are fighting and to me,
	when people start operating in this mode, something is already missing in the relationship.
But of course, I'm also aware
	that there are like people who are involved in relationships that are abusive,
		that are exploitative.
Like one person is always expected to give, to the extent that the person is damaged.
That person's personal space and freedom and autonomy are all compromised.
And there is like one person who is constantly demanding for his or her needs to be met.
That, of course, is problematic as well, right?

But I think in an ideal relationship, people should be fully autonomous,
	and they actually should be able to derive pleasure and satisfaction through the act of giving.
And if you for some reason are not able to do that,
	or you're not	either when you're giving, not because you want to but you're made to
		or you do not experience fulfillment from your giving.
Then, I think it is probably time for you to be re-examining the relationship.
#+end_verse
** expression
intrinsic [ɪnˈtrɪnsɪk] intrinsically: adj.adv. being part of the nature or character of someone or something OPP extrinsic固有的, 内在的, 本质的
given [ˈɡɪv(ə)n]: n. a basic fact that you accept as being true固有事实
equity [ˈekwəti] equitable: n.adj. n.adj. treating all people in a fair and equal way OPP inequitable公平的
reciprocal [rɪˈsɪprək(ə)l]: adj. a reciprocal arrangement or relationship is one in which two people or groups do or give the same things to each other ⇨ mutual互惠的
oppressive [əˈpresɪv]: adj. powerful, cruel, and unfair压迫的
exploit [ɪkˈsplɔɪt] exploitative: v.adj. to treat someone unfairly by asking them to do things for you, but giving them very little in return – used to show disapproval剥削
gross [ɡroʊs] grossly: adj.adv. clearly wrong and unacceptable过分的
forgo [fɔrˈɡoʊ]: v. to not do or have something pleasant or enjoyable SYN go without放弃
pacify [ˈpæsɪˌfaɪ]: v. to make someone calm, quiet, and satisfied after they have been angry or upset安抚
derive [dɪˈraɪv]: v. to get something, especially an advantage or a pleasant feeling, from something得到
compromise [ˈkɑmprəˌmaɪz]: v. to reach an agreement in which everyone involved accepts less than what they wanted at first妥协
problematic [ˌprɑbləˈmætɪk]: adj. involving problems and difficult to deal with有问题的
autonomous [ɔˈtɑnəməs]: adj. an autonomous place or organization is free to govern or control itself SYN independent自治的
--------------------
with sth. in mind: 考虑到某事
in sb's fair share: 在某人的公平份额
in this mode: 在这种模式下
