English/SSLD/4-1 4.5 Power, Balance and Giving.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-25 Wed 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org3a5fe77" class="outline-2">
<h2 id="org3a5fe77">4-1 4.5 Power, Balance and Giving</h2>
<div class="outline-text-2" id="text-org3a5fe77">
<p class="verse">
Okay, so relationships are complex<br />
&#xa0;and the whole idea of one person intrinsically having more power than the other.<br />
You're ultimately saying that's not a given.<br />
So with this in mind,<br />
&#xa0;is there a way for a relationship to be totally equitable and reciprocal in terms of power?<br />
I have to be very careful here,<br />
&#xa0;like if I say that we don't have to be like always fair<br />
&#xa0;&#xa0;and relationships do not have to be equitable,<br />
&#xa0;I can probably get myself into deep trouble, right?<br />
[LAUGH] So I have to be very careful here.<br />
Well obviously, we do not want to see any relationship turning into something that is oppressive.<br />
That is exploitative.<br />
That is grossly unfair for one or both of the participants.<br />
But having said that, we have to understand<br />
&#xa0;that like the whole concept of fairness and equity probably<br />
&#xa0;&#xa0;needs some kind of like careful, critical re-thinking.<br />
<br />
You know, in the relationship, like very often, ideal relationships would have this element of love.<br />
And this element of love, according to my own understanding,<br />
&#xa0;can very often entail one party making certain sacrifices, so to speak.<br />
Imagine like a mother waking up like 3 AM in the morning to a crying baby, all right?<br />
Then, the mother will, obviously, be forgoing some of her own needs, like the need for rest,<br />
&#xa0;like may have something important to deal with in the morning or whatever.<br />
But then in an ideal situation, the mother will actually feel good after pacifying a baby.<br />
And then, the baby is not crying again and she then goes back to sleep.<br />
So in this particular act, the mother gives and the baby receives.<br />
But then maybe the mother derives a bigger sense of satisfaction than the baby,<br />
&#xa0;we don't know, all right?<br />
I cannot be sure.<br />
But that's just how it may work.<br />
And then when we look at any like ideal loving relationship.<br />
That's what we hope will happen.<br />
<br />
And people are not calculating like I've given this much and you have not.<br />
Like put in your fair share.<br />
And I've done so much for you and you don't really care for me.<br />
We hear that a lot when couples are fighting and to me,<br />
&#xa0;when people start operating in this mode, something is already missing in the relationship.<br />
But of course, I'm also aware<br />
&#xa0;that there are like people who are involved in relationships that are abusive,<br />
&#xa0;&#xa0;that are exploitative.<br />
Like one person is always expected to give, to the extent that the person is damaged.<br />
That person's personal space and freedom and autonomy are all compromised.<br />
And there is like one person who is constantly demanding for his or her needs to be met.<br />
That, of course, is problematic as well, right?<br />
<br />
But I think in an ideal relationship, people should be fully autonomous,<br />
&#xa0;and they actually should be able to derive pleasure and satisfaction through the act of giving.<br />
And if you for some reason are not able to do that,<br />
&#xa0;or you're not	either when you're giving, not because you want to but you're made to<br />
&#xa0;&#xa0;or you do not experience fulfillment from your giving.<br />
Then, I think it is probably time for you to be re-examining the relationship.<br />
</p>
</div>
