English/SSLD/4-1 4.5 Power, Balance and Giving.html
<div id="outline-container-org56bcfc7" class="outline-3">
<h3 id="org56bcfc7">expression</h3>
<div class="outline-text-3" id="text-org56bcfc7">
<p>
intrinsic [ɪnˈtrɪnsɪk] intrinsically: adj.adv. being part of the nature or character of someone or something OPP extrinsic固有的, 内在的, 本质的<br />
given [ˈɡɪv(ə)n]: n. a basic fact that you accept as being true固有事实<br />
equity [ˈekwəti] equitable: n.adj. n.adj. treating all people in a fair and equal way OPP inequitable公平的<br />
reciprocal [rɪˈsɪprək(ə)l]: adj. a reciprocal arrangement or relationship is one in which two people or groups do or give the same things to each other ⇨ mutual互惠的<br />
oppressive [əˈpresɪv]: adj. powerful, cruel, and unfair压迫的<br />
exploit [ɪkˈsplɔɪt] exploitative: v.adj. to treat someone unfairly by asking them to do things for you, but giving them very little in return – used to show disapproval剥削<br />
gross [ɡroʊs] grossly: adj.adv. clearly wrong and unacceptable过分的<br />
forgo [fɔrˈɡoʊ]: v. to not do or have something pleasant or enjoyable SYN go without放弃<br />
pacify [ˈpæsɪˌfaɪ]: v. to make someone calm, quiet, and satisfied after they have been angry or upset安抚<br />
derive [dɪˈraɪv]: v. to get something, especially an advantage or a pleasant feeling, from something得到<br />
compromise [ˈkɑmprəˌmaɪz]: v. to reach an agreement in which everyone involved accepts less than what they wanted at first妥协<br />
problematic [ˌprɑbləˈmætɪk]: adj. involving problems and difficult to deal with有问题的<br />
autonomous [ɔˈtɑnəməs]: adj. an autonomous place or organization is free to govern or control itself SYN independent自治的<br />
</p>
<hr />
<p>
with sth. in mind: 考虑到某事<br />
in sb's fair share: 在某人的公平份额<br />
in this mode: 在这种模式下<br />
</p>
</div>
</div>
<div id="outline-container-orgca7fe72" class="outline-3">
<h3 id="orgca7fe72">sentence</h3>
<div class="outline-text-3" id="text-orgca7fe72">
<p>
intrinsic [ɪnˈtrɪnsɪk] intrinsically: adj.adv. being part of the nature or character of someone or something OPP extrinsic固有的, 内在的, 本质的<br />
</p>
<ul class="org-ul">
<li>The love from the dying lion was so intrinsic that even the hunter was unwilling to kill her infant.<br /></li>
<li>It is the intrinsic interest of the story that people admire for, not you.<br /></li>
<li>I have been studying English for two years, enjoying the intrinsic interest of English stories.<br /></li>
</ul>
<p>
given [ˈɡɪv(ə)n]: n. a basic fact that you accept as being true固有事实<br />
</p>
<ul class="org-ul">
<li>Living in poverity in his youth is not a given.<br /></li>
<li>The detective found out that what she told was not a given, she made it.<br /></li>
<li>These days, people regard women receiving more priorities in public as a given.<br /></li>
</ul>
<p>
equity [ˈekwəti] equitable: n.adj. n.adj. treating all people in a fair and equal way OPP inequitable公平的<br />
</p>
<ul class="org-ul">
<li>When you presented a gift to your nephew and not to you niece, it was obviously equitable.<br /></li>
<li>It was equitable that my sister received a warmer welcome at grandmother's home.<br /></li>
<li>The parents go out of their ways to provide equitable conditions with the twin brothers.<br /></li>
</ul>
<p>
reciprocal [rɪˈsɪprək(ə)l]: adj. a reciprocal arrangement or relationship is one in which two people or groups do or give the same things to each other ⇨ mutual互惠的<br />
</p>
<ul class="org-ul">
<li>I have benefited from reciprocal ideas which my father taught me in my youth.<br /></li>
<li>The workers were due to go on a strike so that they could reach reciprocal agreements with entrepreneurs.<br /></li>
<li>I had no idea why you treated a reciprocal agreement as oppressive.<br /></li>
</ul>
<p>
oppressive [əˈpresɪv]: adj. powerful, cruel, and unfair压迫的<br />
</p>
<ul class="org-ul">
<li>The vicious king drew up a set of oppressive laws, which inspired rebellions.<br /></li>
<li>She was in an oppressive relationship in high school, which got her into serious trouble.<br /></li>
<li>On coming to power, the prime minister prohibited a series of oppressive laws.<br /></li>
</ul>
<p>
exploit [ɪkˈsplɔɪt] exploitative: v.adj. to treat someone unfairly by asking them to do things for you, but giving them very little in return – used to show disapproval剥削<br />
</p>
<ul class="org-ul">
<li>If we don't exploit your people, how can you feast on your ceremonies and so many concubines?<br /></li>
<li>You should re-examine the relationship that's exploitative in your opinion.<br /></li>
<li>With the price of real estate going up, there is an increasing number of people feeling exploitative.<br /></li>
</ul>
<p>
gross [ɡroʊs] grossly: adj.adv. clearly wrong and unacceptable过分的<br />
</p>
<ul class="org-ul">
<li>The gross treatment from his father made him burst into tears.<br /></li>
<li>It was incredible that your girl friend asked for a grossly expensive gift in a week.<br /></li>
<li>I was naive enough to believe that my wife would only ask for a grossly expensive gift in a year.<br /></li>
</ul>
<p>
forgo [fɔrˈɡoʊ]: v. to not do or have something pleasant or enjoyable SYN go without放弃<br />
</p>
<ul class="org-ul">
<li>She went to the party which her close friend held forgoing the date.<br /></li>
<li>It is unacceptable for the single mother to forgo her children.<br /></li>
<li>You bore a strong resemblance to your lord father, forgoing your lover for the position.<br /></li>
</ul>
<p>
pacify [ˈpæsɪˌfaɪ]: v. to make someone calm, quiet, and satisfied after they have been angry or upset安抚<br />
</p>
<ul class="org-ul">
<li>Only being reunited with its mother will pacify the baby dragon.<br /></li>
<li>There's a certain probability that your mother have pacified your brother in the morning.<br /></li>
<li>The chance of using a toy to pacify your sister hit zero.<br /></li>
</ul>
<p>
derive [dɪˈraɪv]: v. to get something, especially an advantage or a pleasant feeling, from something得到<br />
</p>
<ul class="org-ul">
<li>Your father is communicating with your uncle to derive the toy you desire for.<br /></li>
<li>Surrender the island to our king, or you will derive no peace from our cavalry.<br /></li>
<li>The scientist expected to derive some special material from the outer space.<br /></li>
</ul>
<p>
compromise [ˈkɑmprəˌmaɪz]: v. to reach an agreement in which everyone involved accepts less than what they wanted at first妥协<br />
</p>
<ul class="org-ul">
<li>What is most remarkable about the new prime minister is that he tends to compromise with these nomads rather than start a war.<br /></li>
<li>After two countries were compromised, their cavalries were just the right distance from each other.<br /></li>
<li>I am aware that she has no intention of compromising in the project.<br /></li>
</ul>
<p>
problematic [ˌprɑbləˈmætɪk]: adj. involving problems and difficult to deal with有问题的<br />
</p>
<ul class="org-ul">
<li>Why the ball had hit the surface of the refrigerator was problematic.<br /></li>
<li>It was problematic that your child played truant from school.<br /></li>
<li>It was problematic that your child lost his heart after failing the exam.<br /></li>
</ul>
<p>
autonomous [ɔˈtɑnəməs]: adj. an autonomous place or organization is free to govern or control itself SYN independent自治的<br />
</p>
<ul class="org-ul">
<li>The local grocer was so autonomous that he refused to pay protection money.<br /></li>
<li>The province is so autonomous that the king has no right to order its cavalry.<br /></li>
<li>The king feels unease about the autonomous colony after he fails to levy taxes.<br /></li>
</ul>
<hr />
<p>
with sth. in mind: 考虑到某事<br />
</p>
<ul class="org-ul">
<li>With your safety in mind, I had to pay a ransom of 1000 dollars to the kidnapper.<br /></li>
<li>With the fate of his family in mind, the chemistry teacher having cancer in high school cooked meth to make money.<br /></li>
<li>With your emotion in mind, I don't dare to express my needs.<br /></li>
</ul>
<p>
in sb's fair share: 在某人的公平份额<br />
</p>
<ul class="org-ul">
<li>Needless to say, she didn't put in her fair share.<br /></li>
<li>Whether the student put in his fair share is contingent on the rules or the punishments you set up.<br /></li>
<li>I will only assemble these building block into robots in my fair share.<br /></li>
</ul>
<p>
in this mode: 在这种模式下<br />
</p>
<ul class="org-ul">
<li>You will never derive pleasure from the relationship in this mode.<br /></li>
<li>People will fall into heavy debts in this mode.<br /></li>
<li>Tree saps remain the domain of insects or tiny animals in this mode.<br /></li>
</ul>
</div>
</div>
